NordicPlayground/nrf5-ble-docomo-linking/examples/ble_peripheral/experimental_ble_app_linking_led/main.c
/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *)DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for putting the chip into sleep mode.
 *
 * @note This function will not return.
 */
static void sleep_mode_enter(void)
{
    uint32_t err_code = bsp_indication_set(BSP_INDICATE_IDLE);
    APP_ERROR_CHECK(err_code);

    // Prepare wakeup buttons.
    err_code = bsp_btn_ble_sleep_mode_prepare();
    APP_ERROR_CHECK(err_code);

    // Go to system-off mode (this function will not return; wakeup will cause a reset).
    err_code = sd_power_system_off();
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling advertising events.
 *
 * @details This function will be called for advertising events which are passed to the application.
 *
 * @param[in] ble_adv_evt  Advertising event.
 */
static void on_adv_evt(ble_adv_evt_t ble_adv_evt)
{
    uint32_t err_code;

    switch (ble_adv_evt)
    {
        case BLE_ADV_EVT_FAST:
            err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING);
            APP_ERROR_CHECK(err_code);
            break;
        case BLE_ADV_EVT_IDLE:
            break;
        default:
            break;
    }
}

/**@brief Function for initializing the Advertising functionality.
 */
static void advertising_init(void)
{
    uint32_t      err_code;
    ble_advdata_t advdata;
    ble_advdata_t scanrsp;

    ble_uuid_t adv_uuids[] = {{PDLS_UUID_SERVICE, m_pdls.uuid_type}};

    // Build advertising data struct to pass into @ref ble_advertising_init.
    memset(&advdata, 0, sizeof(advdata));

    advdata.name_type               = BLE_ADVDATA_FULL_NAME;
    advdata.include_appearance      = true;
    advdata.flags                   = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;

    ble_adv_modes_config_t options = {0};
    options.ble_adv_fast_enabled  = BLE_ADV_FAST_ENABLED;
    options.ble_adv_fast_interval = APP_ADV_INTERVAL;
    options.ble_adv_fast_timeout  = APP_ADV_TIMEOUT_IN_SECONDS;

    memset(&scanrsp, 0, sizeof(scanrsp));
    scanrsp.uuids_complete.uuid_cnt = sizeof(adv_uuids) / sizeof(adv_uuids[0]);
    scanrsp.uuids_complete.p_uuids  = adv_uuids;

    err_code = ble_advertising_init(&advdata, &scanrsp, &options, on_adv_evt, NULL);
    APP_ERROR_CHECK(err_code);
}

#if 0
/**@brief Function for handling write events to the LED characteristic.
 *
 * @param[in] p_lbs     Instance of LED Button Service to which the write applies.
 * @param[in] led_state Written/desired state of the LED.
 */
static void led_write_handler(ble_lbs_t * p_lbs, uint8_t led_state)
{
    if (led_state)
    {
        LEDS_ON(LEDBUTTON_LED_PIN);
    }
    else
    {
        LEDS_OFF(LEDBUTTON_LED_PIN);
    }
}
#endif

ble_pdls_result_code_t pdns_event_handler(ble_pdls_t * p_pdls, ble_pdns_event_data_t *p_pdns_event)
{
    uint32_t err_code = NRF_SUCCESS;
    static uint16_t unique_id;
   
    NRF_LOG_PRINTF("[LINKING] PDNS event received: %02x\r\n", p_pdns_event->event);
    switch (p_pdns_event->event)
    {
      case PDNS_EVT_NOTIFY_INFO:
      {
          switch (p_pdns_event->data.notifyinfo.notifycategory)
          {
            case PDNS_NOTIFY_CATEGORY_ETC:
            {
              if (p_pdns_event->data.notifyinfo.parameteridlist & PDNS_PARAMID_ETC_PACKAGE)
              {
                  unique_id = p_pdns_event->data.notifyinfo.uniqueid;
                  err_code = ble_pdls_pdns_get_pd_notify_detail_data(p_pdls, unique_id, PDNS_PARAM_PACKAGE, 0);
              }
            }
            break;
            
            case PDNS_NOTIFY_CATEGORY_NOTNOTIFY:
            case PDNS_NOTIFY_CATEGORY_ALL:
            case PDNS_NOTIFY_CATEGORY_PHONEINCOMINGCALL:
            case PDNS_NOTIFY_CATEGORY_PHONEINCALL:
            case PDNS_NOTIFY_CATEGORY_PHONEIDLE:
            case PDNS_NOTIFY_CATEGORY_MAIL:
            case PDNS_NOTIFY_CATEGORY_SCHEDULE:
            case PDNS_NOTIFY_CATEGORY_GENERAL:
            default:
              break;
          }
      }
      break;
     
      case PDNS_EVT_GET_PD_NOTIFY_DETAIL_DATA_RESP:
      {
        if ((PDLS_RESULT_OK == p_pdns_event->data.notifydetail.result) &&
            (unique_id == p_pdns_event->data.notifydetail.uniqueid))
        {
            NRF_LOG_PRINTF("[LINKING] Package: %s\r\n", p_pdns_event->data.notifydetail.data.p_val);
        }
      }
      break;
     
      case PDNS_EVT_START_PD_APP_RESP:
      default:
        break;
   }
    
   if (NRF_SUCCESS == err_code)
     return PDLS_RESULT_OK;
   else
     return PDLS_RESULT_ERROR_FAILED;
}

ble_pdls_result_code_t pdsos_event_handler(ble_pdls_t * p_pdls, ble_pdsos_event_data_t *p_pdsos_event)
{
    uint32_t err_code = NRF_SUCCESS;
   
    NRF_LOG_PRINTF("[LINKING] PDSOS event received: %02x\r\n", p_pdsos_event->event);
    switch (p_pdsos_event->event)
    {
      case PDSOS_EVT_GET_SETTING_INFO:
      {
        ble_pdsos_setting_info led_setting_info = { 
          .setting_id = PDSOS_SETTING_VALUE_ID_LED,
          .notify_time = PDSOS_NOTIFY_TIME_OFF, 
          .setting.led_setting.color_num        = 3,    // 3: RGB
          .setting.led_setting.color_selected   = 1,    // R
          .setting.led_setting.pattern_num      = 0,    // none
          .setting.led_setting.pattern_selected = 0     // none
        };
        err_code = ble_pdls_pdsos_get_setting_info_resp(p_pdls, PDLS_RESULT_OK, &led_setting_info);
      }
      break;
      
      case PDSOS_EVT_GET_SETTING_NAME:
      {
        char led_setting_name_str[] = {0x04, 'R', 'E', 'D', '\0',
                                       0x06, 'G', 'R', 'E', 'E', 'N', '\0',
                                       0x05, 'B', 'L' ,'U', 'E', '\0'};
        ble_pdsos_setting_name led_setting_name = {
          .setting.len = 18,
          .setting.p_val = (uint8_t *)led_setting_name_str
        };
        err_code = ble_pdls_pdsos_get_setting_name_resp(p_pdls, PDLS_RESULT_OK, &led_setting_name);
      }
      break;
      
      case PDSOS_EVT_SELECT_SETTING_INFO:
      {
        err_code = ble_pdls_pdsos_select_setting_info_resp(p_pdls, PDLS_RESULT_OK);
      }
      break;
        
      default:
        break;
    }
    
   if (NRF_SUCCESS == err_code)
     return PDLS_RESULT_OK;
   else
     return PDLS_RESULT_ERROR_FAILED;
}

/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
    uint32_t        err_code;
    ble_pdls_init_t init;

    //PDPIS
    init.servicelist          = PDPIS_SERVICE_BITMASK_PIS | 
                                PDPIS_SERVICE_BITMASK_NS  |
                                PDPIS_SERVICE_BITMASK_SOS;
    init.deviceid             = 0xEEFF;     // any data
    init.deviceuid            = 0xDEADBEAF; // any data
    init.devicecapability     = PDPIS_CAPABILITY_BITMASK_HASLED;

    init.notifycategory       = PDNS_NOTIFY_CATEGORY_ETC;
    init.pdns_event_handler   = pdns_event_handler;
    
    init.pdsos_event_handler  = pdsos_event_handler;
  
